// 判断101-200之间有多少个素数，并输出所有素数
// 质数又称素数。一个大于1的自然数，除了1和它自身外，不能被其他自然数整除的数叫做质数；否则称为合数。
// 1到100的素数有：2,3,5,7,11,13,17,19,23,29,31,37,41,43,53,59,61,67,71,73,79,83,89,97。


var arr = [];
for(var i = 101; i <= 200; i++) {
    for(var j = 2; j < i; j++) {
        if(i % j === 0) {
            break;
        }
        if(j === i - 1) {
            arr.push(i);
        }
    }
}


// 优化 
var arr = [];
for (var i = 1; i <= 200; i++) {
    if (i === 2) {
        arr.push(i);
    }
    for (var j = 2, len = (i / 2).toFixed(); j <= len; j++) {

        if (i % j === 0) {
            break;
        }
        if (j >= len) {
            arr.push(i);
        }
    }
}



















