// 求100之内的素数
// 质数定义为在大于1的自然数中，除了1和它本身以外不再有其他因数。

// 2 3 5 7 11 13 17 19 23 29
// 31 37 41 43 47 53 59 61 67 71
// S1 从1至72有20个
// 73 79 83 89 97
// 101 103 107 109 113
// 127 131 137 139 149 151 157 163 167 173
// 179 181 191 193 197 199 211


var arr = [];
for (var i = 2; i <= 100; i++) {
    if (i === 2) {
        arr.push(i);
        continue;
    }
    for (var j = 2; j <= i; j++) {
        if (j === i) {
            arr.push(i);
            break
        }
        if (i % j === 0) {
            break;
            // 不是素数
        }

    }
}
console.log(arr); // [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]





